### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [2]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [15]:
df = pd.DataFrame.from_dict(mydict, orient='index', columns=['index'])
df

   index
a      0
b      1
c      2
e      3
d      4
f      5
g      6
h      7
i      8
j      9
k     10
l     11
m     12
n     13
o     14
p     15
q     16
r     17
s     18
t     19
u     20
v     21
w     22
x     23
y     24
z     25

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [16]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [21]:
ser.value_counts()

a    6
d    6
f    5
b    4
g    3
e    2
h    2
c    2
dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

In [24]:
selected_col = ['a','b','c']
pd.read_csv(, selected_col)

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [25]:
# read fruits.csv file
pf = pd.read_csv('./fruits.csv')

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [38]:
pf

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

In [43]:
df1 = pf.groupby('Fruit Name')['Price']

In [44]:
df1.aggregate(['mean', 'median', 'max'])

                  mean  median  max
Fruit Name
Banana       98.500000    98.5  112
Mango       106.666667   100.0  160
PineApple   187.500000   187.5  285
Strawberry  200.000000   200.0  200

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

In [52]:
pf['Price'].sum()

1092

In [53]:
pf['Price']

0    112
1    160
2     85
3     90
4    200
5     60
6    100
7    285
Name: Price, dtype: int64

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [56]:
maxi = pf

In [61]:
maxi['max_price'] = maxi['Quantity'] / maxi['Price']

In [64]:
maxi.min()

Fruit Name      Banana
Quantity            15
Price               60
max_price     0.166667
dtype: object

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

In [66]:
arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]
unique_values = sorted(set(arr))

In [67]:
one_shot = pd.DataFrame(columns=unique_values)

In [70]:
for value in unique_values:
    one_shot[value] = [1 if x == value else 0 for x in arr]

In [74]:
one_shot.head()

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [91]:
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]
        }

new_columns = ['First Score', 'Second Score', 'Third Score']

df = pd.DataFrame(dict_, columns=new_columns)

In [85]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [92]:
df.isna().sum()

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [94]:
df.fillna(df.mean())

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [95]:
pf = pd.read_csv('./fruits.csv')

In [102]:
pf.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [103]:
pf

   level_0  index  Fruit Name  Quantity  Price
0        0      0      Banana        78    112
1        1      1       Mango        40    160
2        2      2      Banana        20     85
3        3      3   PineApple        15     90
4        4      4  Strawberry       100    200
5        5      5       Mango        25     60
6        6      6       Mango        40    100
7        7      7   PineApple        50    285

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [105]:
db1 = pd.read_csv('./sample_sheet_1.csv')
db2 = pd.read_csv('./sample_sheet_2.csv')

In [106]:
db1

  Location Population  House_count Location Area
0      ABB   2.5 lakh          763    25 hectare
1      ABC   1.5 lakh          520    20 hectare
2      CDD   3.5 lakh          800    35 hectare

In [107]:
db2

  Location  No. of shops Weekly market day
0      ABB           150   Nothing as such
1      ABC           120           Tuesday
2      CDD           180         Wednesday

In [108]:
db1.merge(db2, how='inner')

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday